[
  {
    "id": "2",
    "slug": "how-mehul-built-a-22-cr-year-company-after-dropping-out-of-college",
    "layoutType": "blog2",
    "blogTitle": "How Mehul Built a ₹22 Cr/year Company After Dropping Out of College",
    "blogImg": "https://founderstories.org/wp-content/uploads/2025/06/Say-Solar.png",
    "blogDate": "Posted on June 6, 2025 by Harsh Shah",
    "blogData": "<p>This Week, I had the privilege of catching up with <b>Mr.Mehul</b>, founder of <strong>Say Solar</strong>.</p><p>What began as a casual coffee conversation turned into something far deeper - a story not just about building a business, but about <strong>transforming a mindset, overcoming odds, and choosing purpose over shortcuts.</strong></p><h2>The Backbencher No One Expected</h2><p>Let me take you back to college days.</p><p>Mehul was never the “model student.”</p><ul><li>A <strong>backbencher</strong> by choice.</li><li><strong>Low scores</strong> and barely scraping by in exams.</li><li>He was <strong>detained in Semester 3</strong>.</li></ul><p>To most people, that would have written him off. Nobody - not even professors or peers - imagined he’d one day lead a multi-crore business that’s shaping the future of renewable energy in Gujarat.</p><p>But behind those quiet classrooms sat a young man with fire in his gut.</p><p>A fire to do something meaningful. To build something that <em>mattered.</em></p><h2>Betting on Solar, Not on Shortcuts</h2><p>After college, while others rushed to land stable jobs, Mehul made a choice that changed everything.</p><p>He saw the rising need - and broken trust - in India’s solar energy market. Especially in Gujarat, a state blessed with sunlight but underserved by reliable solutions.</p><p>And so, with <strong>no funding, no big brand name, and no safety net</strong>, Mehul started <strong>Say Solar</strong> - a venture rooted in <strong>trust, transparency, and technology</strong>.</p><p>His goal?<br /><strong>To make solar energy accessible and trustworthy for every household.</strong></p><p>Not just installations. But education, service, and long-term support.</p><h2>Numbers That Tell a Deeper Story</h2><p>Fast forward to 2025, and Say Solar isn’t just growing - it’s thriving.</p><ul><li><strong>5000+ solar rooftop installations</strong> across Gujarat</li><li><strong>₹22 Crore turnover</strong> in FY 2024–25</li><li>Fully automated <strong>CRM &amp; operations with Zoho</strong></li><li>A <strong>scalable dealer network</strong> expanding rapidly</li><li>Bold mission: <strong>Solarizing 1,00,000 homes by 2030</strong></li></ul><p>These numbers are impressive, but what stands out more is the philosophy Mehul operates with.</p><p>He doesn’t talk like a salesperson.<br />He speaks like a <strong>system builder</strong>, an <strong>educator</strong>, a <strong>visionary</strong> who knows the impact of every solar panel he installs.</p><h2>The Mindset Shift: From Marks to Mission</h2><p>The most inspiring part?</p><p>Mehul never blames his past.<br />Never hides his low scores.<br />Never denies the tough start.</p><p>Instead, he embraces it because it shaped him.<br />His story is a living example of something we all need to hear more often:</p><blockquote><p><em>“Your marks don’t define your mindset.<br />Your failures don’t define your future.”</em></p></blockquote><p>We’re conditioned to believe success comes to toppers, those who tick every box.<br />But Mehul proves it’s <strong>effort</strong>, <strong>resilience</strong>, and <strong>systems thinking</strong> that win the long game.</p><hr /><h2>Final Thoughts: A Gujarati Entrepreneur Who’s Leading with Grit</h2><p>As someone who’s known Mehul from the “backbencher days,” I couldn’t be more proud.</p><p>He represents a new kind of founder - not chasing vanity metrics, not flashing investor decks, but <strong>building quietly and boldly</strong>, with purpose at the center.</p><p>And if there’s one thing to take away from his journey, it’s this:</p><blockquote><p><em>Being average on paper means nothing<br />when you’re extraordinary in effort.</em></p></blockquote><p>Here’s to more stories like this - of real founders, real impact, and the quiet revolutions happening in small towns and sunny rooftops across India.</p><hr />",
    "categories": [
      {
        "id": 1,
        "name": "Meet Up",
        "slug": "meet-up",
        "link": "/category/meet-up/"
      }
    ]
  }
]
